# Задание 1
# Необходимо вывести имена всех учеников из списка с новой строки

names = ['Оля', 'Петя', 'Вася', 'Маша']
print('\nЗадание 1')
[print(name) for name in names]


# Задание 2
# Необходимо вывести имена всех учеников из списка, рядом с именем показать количество букв в нём
# Пример вывода:
# Оля: 3
# Петя: 4

names = ['Оля', 'Петя', 'Вася', 'Маша']
print('\nЗадание 2')
[print(f'{name}: {len(name)}') for name in names]


# Задание 3
# Необходимо вывести имена всех учеников из списка, рядом с именем вывести пол ученика

is_male = {
    'Оля': False,  # если False, то пол женский
    'Петя': True,  # если True, то пол мужской
    'Вася': True,
    'Маша': False,
}
names = ['Оля', 'Петя', 'Вася', 'Маша', 'Максим']
print('\nЗадание 3')
for name in names:
    try:
        if is_male[name]:
            print(f'{name}: Мужской')
        else:
            print(f'{name}: Женский')
    except KeyError:
        print(f'Не знаю такого имени: {name}')


# Задание 4
# Даны группу учеников. Нужно вывести количество групп и для каждой группы – количество учеников в ней
# Пример вывода:
# Всего 2 группы.
# Группа 1: 2 ученика.
# Группа 2: 4 ученика.

groups = [
    ['Вася', 'Маша'],
    ['Вася', 'Маша', 'Саша', 'Женя'],
    ['Оля', 'Петя', 'Гриша'],
]
print('\nЗадание 4')
print(f'Всего {len(groups)} группы')
for index, group in enumerate(groups, start=1):
    print(f"Группа {index}: {len(group)} ученика")


# Задание 5
# Для каждой пары учеников нужно с новой строки перечислить учеников, которые в неё входят
# Пример вывода:
# Группа 1: Вася, Маша
# Группа 2: Оля, Петя, Гриша

groups = [
    ['Вася', 'Маша'],
    ['Оля', 'Петя', 'Гриша'],
    ['Вася', 'Маша', 'Саша', 'Женя'],
]
print('\nЗадание 5')
[print(f"Группа {index}: {', '.join(group)}")
 for index, group in enumerate(groups, start=1)]
